//**************************************************
//
// Hackathon ( bg.cpp )
// Author  : katsuki mizuki
//
//**************************************************

//==================================================
// インクルード
//==================================================
#include "main.h"
#include "bg.h"
#include "rectangle.h"
#include "texture.h"

//==================================================
// スタティック変数
//==================================================
namespace
{
int	s_nIdxBG;	// 背景の矩形のインデックス
}// namespaceはここまで

//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitBG(void)
{
	{// 背景
		// 矩形の設定
		s_nIdxBG = SetRectangle(TEXTURE_NONE);

		D3DXVECTOR3 pos = D3DXVECTOR3(SCREEN_WIDTH * 0.5f, SCREEN_HEIGHT * 0.5f, 0.0f);
		D3DXVECTOR3 size = D3DXVECTOR3(SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f);

		// 矩形の位置の設定
		SetPosRectangle(s_nIdxBG, pos, size);
	}
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitBG(void)
{
	// 使うのを止める
	StopUseRectangle(s_nIdxBG);
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateBG(void)
{
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawBG(void)
{
	/* 矩形で描画してます */
}
