//**************************************************
//
// Hackathon ( select.h )
// Author  : katsuki mizuki
//
//**************************************************
#ifndef _SELECT_H_	//このマクロ定義がされてなかったら
#define _SELECT_H_	//２重インクルード防止のマクロ定義

//==================================================
// インクルード
//==================================================
#include "texture.h"
#include "menu.h"

//==================================================
// 構造体
//==================================================

/*↓ メニューの引数 ↓*/
typedef struct
{
	TEXTURE	texture[MAX_OPTION];	// テクスチャ
	int		nNumUse;				// 使用数
	float	fLeft;					// 左端
	float	fRight;					// 右端
	float	fTop;					// 上端
	float	fBottom;				// 下端
	float	fWidth;					// 選択肢の幅
	float	fHeight;				// 選択肢の高さ
	bool	bSort;					// 並べ方 [ true : 縦 false : 横 ]
}SelectArgument;

//==================================================
// プロトタイプ宣言
//==================================================
//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitSelect(void);

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitSelect(void);

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateSelect(void);

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawSelect(void);

//--------------------------------------------------
// 設定
// 引数1  : SelectArgument &menu / 構造体 メニュー情報
// 返値   ; int / 何番目かのインデックス
//--------------------------------------------------
int SetSelect(const SelectArgument &menu);

//--------------------------------------------------
// メニューのリセット
// 引数  : int nIdx / メニューのインデックス
//--------------------------------------------------
void ResetSelect(int nIdx);

//--------------------------------------------------
// 描画するかどうか
// 引数1  : int nIdx / メニューのインデックス
// 引数2  : bool bDraw / 描画するかどうか
//--------------------------------------------------
void SetDrawSelect(int nIdx, bool bDraw);

#endif // !_SELECT_H_
